In [2]:
import numpy as np

In [7]:
import pandas as pd

In [3]:
x = np.arange(15, dtype=np.int64)

In [4]:
x

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [5]:
x.reshape(3, 5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [8]:
data = pd.read_csv("./MOCK_DATA.csv")

In [10]:
data.dtypes

id             int64
first_name    object
last_name     object
email         object
gender        object
ip_address    object
dtype: object

In [11]:
data[["id","first_name"]]

       id first_name
0       1       Jena
1       2      Bucky
2       3   Hansiain
3       4      Oates
4       5      Tobin
..    ...        ...
995   996    Skipper
996   997      Gerti
997   998     Munmro
998   999      Stacy
999  1000     Mandel

[1000 rows x 2 columns]